# -*- coding: utf-8 -*-
"""
    Time: 2018-10-01
    Author: Tsystem
"""


from django.http import HttpResponse
import datetime
import json


def handle_news(request):

    resp = {
        "status": 200,
        "message": "success",
        "data": [
            {
                "title": "1不忘改革开放初心——论学习贯彻习近平总书记广东考察重要讲话精神",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "2重庆公交坠江救援进展：潜水员计划今天下潜搜救",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "3小面馆都注册商标了！快查查你的品牌名字是否被抢注",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "4印尼狮航一架客机29日上午坠毁 机上共有188人",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "5金立10亿元债务今日到期，无力还款将破产；ofo被曝延长退押金 ",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "6华为Mate20很无奈：麒麟980+滑盖全面屏+全新智慧系统，仅3699？",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "7不好意思，华为不陪各位友商玩了 ",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "8逆天了！两大支付巨头竟然可以相互转账 ",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "9手机也有“见光死系列”，小米MIX3上手，漂亮还是丑？",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "10支付宝出现“挪车码”，短短几天获几十万人称赞，车主不早点说 ",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "11苹果史上寿命最长手机！iPhone5S重新开售：可升级至最流畅系统 ",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "12欠人会员终要还！王欣再造全新视频软件，看名字就让人想起快播了 ",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "13马化腾新建腾讯大楼“三条金腰带”，王者的象征！",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "14刘强东的野心被暴露！花68亿投资这个部门！马云：这野心太大了 ",
                "url": "",
                "date": "2018-10-06 15:00"
            },
            {
                "title": "15马云11亿盖的新支付宝大楼长什么样，网友：一看就是老司机！ ",
                "url": "",
                "date": "2018-10-06 15:00"
            }
        ]
    }

    return HttpResponse(json.dumps(resp), content_type="application/json")
